from core import *

'''
██████╗░░█████╗░███╗░░██╗░█████╗░███╗░░██╗░█████╗░  ░█████╗░██╗░░░░░██╗░░░░░██╗░█████╗░███╗░░██╗░█████╗░███████╗
██╔══██╗██╔══██╗████╗░██║██╔══██╗████╗░██║██╔══██╗  ██╔══██╗██║░░░░░██║░░░░░██║██╔══██╗████╗░██║██╔══██╗██╔════╝
██████╦╝███████║██╔██╗██║███████║██╔██╗██║███████║  ███████║██║░░░░░██║░░░░░██║███████║██╔██╗██║██║░░╚═╝█████╗░░
██╔══██╗██╔══██║██║╚████║██╔══██║██║╚████║██╔══██║  ██╔══██║██║░░░░░██║░░░░░██║██╔══██║██║╚████║██║░░██╗██╔══╝░░
██████╦╝██║░░██║██║░╚███║██║░░██║██║░╚███║██║░░██║  ██║░░██║███████╗███████╗██║██║░░██║██║░╚███║╚█████╔╝███████╗
╚═════╝░╚═╝░░╚═╝╚═╝░░╚══╝╚═╝░░╚═╝╚═╝░░╚══╝╚═╝░░╚═╝  ╚═╝░░╚═╝╚══════╝╚══════╝╚═╝╚═╝░░╚═╝╚═╝░░╚══╝░╚════╝░╚══════╝
'''


switch_cex = "okx"       # binance, mexc, kucoin, gate, okx, huobi
token = "ETH"           # ETH, APT - смотрим точный тикер на бирже
chain = "Arbitrum one"      # BSC (BEP20), Polygon - смотрим на бирже в окне вывода. Чувствительно к регистру!
amount_usd = [4, 6]     # минимальная и максимальная сумма вывода в $

decimal_places = 7           # количество знаков после запятой
delay = [30, 50]             # минимальная и максимальная задержка
shuffle_wallets = "yes"       # нужно ли перемешать кошельки yes/no



if __name__ == "__main__":
    workaem(token, chain, switch_cex, amount_usd, decimal_places, shuffle_wallets, delay)
